<template>
  <el-row justify="center">
    <h1>Введение</h1>
  </el-row>
  <el-row justify="start">
    <p>Орнитология в Казахстане развивается в течение более двух столетий. Несмотря на столь внушительный срок, лишь видовой состав обитающих у нас птиц и их распространение в республике изучены достаточно полно. Объясняется это как своеобразным географическим положением нашего государства в центре евразийского материка, так и разнообразием природных условий, а также небольшим количеством работающих здесь исследователей. В отличие от Западной Европы количество любителей птиц у нас ничтожно мало и далеко не соответствует нашим потребностям и возможностям.</p>
    <p>Приобретение Казахстаном суверенитета требует с позиций государственности развития науки во всех областях человеческих знаний, особенно в области биологии, поскольку контакты с природой у нас достаточно постоянны.</p>
    <p>Любой живой организм на Земле имеет научное название, присущее только ему. Именно это позволяет разобраться в многообразии окружающего нас мира. Со времени основателя научной классификации Карла Линнея название пишется на латинском языке, хотя у каждого народа существуют местные названия всех или большинства животных. Для каждого указывается род и вид (бинарная номенклатура), или род, вид и подвид, если систематика данной группы изучена более детально. Поскольку каждый живой организм имеет свои особенности строения, именно они используются для составления специальных таблиц, используя которые можно установить его научное название.</p>
    <p>Определители существуют по всем живым организмам, в том числе и по птицам. Они публиковались одновременно со сводками по птицам («Птицы СССР», С.А.Бутурлин, Г.П.Дементьев, 1934, 1935, 1936, 1936; «Птицы Советского Союза», Г.П.Дементьев, Н.А.Гладков, 1951, 1951, 1951, 1952, 1954, 1954; «Птицы СССР» А.И.Иванов, Е.В.Козлова, А.Я.Тугаринов, Л.А.Портенко, 1951, 1953, 1954, 1960; «Птицы Казахстана» И.А.Долгушин, М.А.Кузьмина, М.Н.Корелов, В.Ф.Гаврин, Э.И.Гаврилов, А.Ф.Ковшарь, 1960, 1962, 1970, 1972, 1974). В качестве учебных пособий издавались «Определитель птиц СССР» (Н.А.Гладков, Г.П.Дементьев, Е.С.Птушенко, А.М.Судиловская, 1948, 1964) и «Краткий определитель птиц СССР» (А.И.Иванов, Б.К.Штегман, 1964, 1978). Публиковались и более частные пособия (П.П.Второв, Н.Н.Дроздов, «Определитель птиц фауны СССР», 1980; Мазунин Н.А., «Сводный определитель позвоночных животных Казахстана», 1965 и др.), не получившие широкого применения.</p>
    <p>Поскольку типографским способом определители издавались чрезвычайно редко, было предложено использовать ЭВМ для получения оперативной информации. Первый опыт составления такого определителя на ДВК-3, на языке Бейсик, (Гаврилов, 1994; Selevinia, 2, 2: 75-84), который несмотря на положительную оценку при апробации также не получил достойного применения, и в первую очередь из-за отсутствия или редкости в те годы вычислительной техники.</p>
    <p>Несмотря на кажущуюся простоту процесса определения, следует помнить, что систематика птиц разработана далеко не окончательно. Даже в нашей фауне имеются крупные систематические категории (отряды), объединяющие птиц с достаточно разнообразными морфологическими характеристиками (например, журавлеобразные, ржанкообразные, курообразные), хотя последний отряд достаточно монолитен. С другой стороны, у большинства представителей монолитного семейства овсянковых половой диморфизм четко выражен. У них определение самцов в брачном наряде не вызывает затруднений, тогда как самки и молодые особи осенью дифференцируются очень плохо, поскольку их морфологические характеристики изучены достаточно поверхностно.</p>
    <p>В последние годы орнитологи начинают все шире применять зарубежные справочники по определению птиц в поле, иллюстрированные красочными рисунками и фотографиями. Такое отношение следует приветствовать, поскольку в настоящее время сбор тушек птиц сопряжен с рядом трудностей и даже фундаментальная коллекция Института зоологии практически перестала пополняться. Однако никакие фотографии, даже самые совершенные, не могут заменить значимости морфологических признаков. В тоже время отлов птиц и их кольцевание с последующим выпуском в природу применяется сейчас достаточно широко (хотя для этого необходимо иметь соответствующее разрешение Комитета лесного и охотничьего хозяйства Казахстана). Кроме того, ежегодно птицы погибают от различных причин: столкновений с автотранспортом, проводами и высотными зданиями, от электрического тока (под высоковольтными ЛЭП), болезней и просто по старости. Традиционно у нас существует и любительская охота, причем охотники далеко не всегда знают правильное название добытой, например, утки. В общем, мертвые птицы довольно часто попадают в руки человека. Все это можно использовать для практики по их определению и установлению научного названия.</p>
    <p>В отличие от прежнего определителя, в настоящем широко используются вспомогательные рисунки и фотографии птиц, повышающие точность установления видового названия. Его без особых сложностей можно совершенствовать и дальше, дополняя признаками для определения подвида, пола и возраста птицы.</p>
    <p>Электронный определитель принципиально отличается от традиционных типографских изданий тем, что в нем невозможно заглянуть в последующие пункты, убедиться в правильности избранного пути. Здесь необходимо знать морфологические признаки той или иной птицы. Высококвалифицированный орнитолог должен выходить на любой названный ему вид, не имея птицу в руках. Безусловно, это задача будущего, но к этому нужно стремиться.</p>
    <p>Сохранен традиционный ступенчатый принцип определения – последовательно устанавливается название отряда, семейства, рода и вида, к которому относится находящаяся в руках птица. Однако в отличие от книжных определителей, в которых приводятся две группы взаимоисключающих признаков (теза и антитеза), мы сочли возможным использовать лишь тезу - признаки, характеризующие лишь определенный вид или группу (отряд, семейство, род) птиц, предоставив пользователю право решать, соответствуют ли приведенные признаки определяемой особи, или нет. В силу этого формулировка диагностических признаков потребовала особой четкости, позволяющей уверенно выбрать один из возможных ответов – «Да» или «Нет». Одновременно с названием вида определяемой вами птицы компьютер сообщит основные сведения по ее распространению, характеру пребывания в Казахстане и биологии, заимствованные преимущественно из «Книги генетического фонда фауны Казахской ССР» (Гвоздев, ред., 1989). Это расширит ваши знания и подтвердит или подвергнет сомнению правильность определения. Определитель составлен на основе сводки «Птицы Казахстана» (Долгушин и др., 1960, 1962, 1970, 1972, 1974) с включением новых видов, указанных для территории Республики за истекшее время, а также некоторых изменений и дополнений, повышающих точность определения. Систематика приводится по Л.С.Степаняну (1990).</p>
    <p>Необходимо подчеркнуть, что для удобства пользователя в нашем определителе применяется старый способ отсчета первостепенных маховых (ПМ) - от дистального (наружного) края к проксимальному (внутреннему), причем у многих воробьиных дистальное ПМ сильно редуцировано и бывает полностью скрыто большими верхними кроющими крыла.</p>
    <p>Предполагается, что пользователь знает названия частей тела птицы, владеет орнитологической терминологией и умеет измерять длину крыла, хвоста, цевки и клюва. Однако для освежения этих знаний вы можете просмотреть приводимые рисунки. (Рисунки по Долгушину, 1960)</p>
  </el-row>
  <el-row justify="space-between">
    <el-col :md="12" :xs="24" :sm="24">
      <img src="../assets/introduction/fig1.png"  width="400" height="320">
    </el-col>
    <el-col :md="12" :xs="24" :sm="24">
      <img src="../assets/introduction/fig2.png" width="400" height="320">
    </el-col>
  </el-row>
  <el-row>
    <p>
      Названия частей тела и участков оперения птицы. А – фигура птицы со сложенным крылом, Б – распушенное крыло птицы. 1 – лоб, 2 - темя, 3 – затылок, 4 – уздечка, 5 – бровь, 6 – щеки, 7 – кроющие уха, 8 – надклювье, 9 – подклювье, 10 – ребро надклювья, 11 – разрез рта, 12 – угол рта, 13 – горло, 14 – зоб, 15 – грудь, 16 – брюхо, 17 – передняя часть спины, 18 – задняя часть спины, 19 – плечевые перья (снизу крыла им соответствуют несколько удлиненные подмышечные перья); 17, 18 и 19, вместе, нередко с присоединением 23, 24 и 25 иногда называются мантией, 20 – первостепенные или большие маховые перья, 21 – второстепенные маховые (иногда часть второстепенных маховых резко отличается по окраске, образуя на крыле хорошо заметную полосу – эта полоса называется зеркальцем), 22 – третьестепенные маховые, 23 – малые кроющие крыла, 24 – средние кроющие крыла, 25 и 26 большие кроющие крыла, 27 – крылышко (имеется не у всех птиц), 28 – верхние кроющие крыла, 29 – хвост, рулевые перья, 30 – нижние кроющие хвоста, подхвостье, 31 – плюсна или цевка, 32 – задний или первый палец, 33 – внутренний или второй палей, 34 – средний палец, 35 – наружный, внешний или четвертый палец, 36 – пятка, 37 – кистевой сгиб крыла, 38 – голень, 39 – бок туловища, 40 – поясница, 41 – подбородок, 42 – верхняя сторона шеи, зашеек, 43 – бока шеи (по Долгушину, 1960).
    </p>
  </el-row>
  <el-row>
    <el-col :md="12" :xs="24" :sm="24">
      <img src="../assets/introduction/fig3.png"  width="400" height="320">
    </el-col>
    <el-col :md="12" :xs="24" :sm="24" >
      <p>Измерение a крыла, б клюва, в плюсны (по Долгушину, 1960).</p>
    </el-col>
  </el-row>
  <el-row justify="center" class="start_button">
    <el-button type="success" size="large" @click="this.$router.push('/start-detect')" round :icon="Search">Начать определение</el-button>
  </el-row>
</template>

<script setup>
import { Search } from '@element-plus/icons-vue'

</script>

<style scoped>
p{
  text-align: start;
  margin: 10px;
}
.start_button{
  padding: 20px;
}
</style>